Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A `Multi` emits multiple events (n items, 1 failure or 1 completion). Multis can represent streams of items, potentially unbounded. A good example is receiving messages from a message broker queue.
ja_jp: `Multi` は複数のイベント（n個のアイテム、1つの失敗または1つの完了）を放出します。Multisはアイテムのストリームを表現することができ、無限に広がる可能性があります。例えば、メッセージ・ブローカのキューからメッセージを受信するのが良い例です。

source: A `Mutiny.SessionFactory` will be created based on the Quarkus `datasource` configuration as long as the Hibernate Reactive extension is listed among your project dependencies.
ja_jp: プロジェクトの依存関係の中にHibernate Reactiveエクステンションがリストアップされていれば、Quarkus `datasource` の設定に基づいて `Mutiny.SessionFactory` が作成されます。

source: A `MutinyEmitter` to send message to a channel, so it can be easily integrated with the Mutiny API exposed by Hibernate Reactive or Hibernate Reactive with Panache.
ja_jp: チャネルにメッセージを送信するための `MutinyEmitter`。これにより、Hibernate Reactive または Hibernate Reactive with Panache によって公開される Mutiny API と簡単に統合できます。

source: A `RowSet` does not only hold your data in memory, it also gives you some information about the data itself, such as:
ja_jp: `RowSet` はデータをメモリーに保持するだけでなく、次のようなデータ自体に関する情報も提供します。

source: A `RuntimeException` crossing the transaction boundaries will roll back the transaction.
ja_jp: `RuntimeException` がトランザクションの境界を越えると、トランザクションがロールバックされます。

source: A `RuntimeException` crossing the transaction boundaries will rollback the transaction.
ja_jp: `RuntimeException` がトランザクションの境界を越えると、トランザクションがロールバックされます。

source: A `SectionHelperFactory` annotated with `@EngineConfiguration` is used during validation of templates at build time and automatically registered at runtime (a) as a section factory and (b) as a CDI bean.
ja_jp: `@EngineConfiguration` アノテーションが付けられた `SectionHelperFactory` は、ビルド時のテンプレート検証で使用され、実行時に (a) セクションファクトリー、および、(b) CDI Bean として自動的に登録されます。

source: A `ServiceLoader` storm
ja_jp: `ServiceLoader` の嵐

source: A `StartupEvent` is fired after all `io.quarkus.deployment.builditem.ServiceStartBuildItem` producers have been consumed. The implication of this is that if an extension has services that application components would expect to have been started when they observe a `StartupEvent`, the build steps that invoke the runtime code to start those services needs to produce a `ServiceStartBuildItem` to ensure that the runtime code is run before the `StartupEvent` is sent. Recall that we saw the production of a `ServiceStartBuildItem` in the previous section, and it is repeated here for clarity:
ja_jp: `StartupEvent` は、すべての `io.quarkus.deployment.builditem.ServiceStartBuildItem` プロデューサーが消費された後に実行されます。これは、 `StartupEvent` が確認されるとアプリケーションコンポーネントが起動することを想定したサービスがエクステンションにある場合に、そのようなサービスを起動するためのランタイムコードを呼び出すビルドステップは、 `StartupEvent` の送信前にランタイムコードが実行されるように `ServiceStartBuildItem` を作成する必要があることを意味します。 `ServiceStartBuildItem` の作成については前のセクションで説明しましたが、確認のためにここでも繰り返します。

source: A `TimeTable` wraps all `Timeslot`, `Room`, and `Lesson` instances of a single dataset. Furthermore, because it contains all lessons, each with a specific planning variable state, it is a _planning solution_ and it has a score:
ja_jp: `TimeTable` は、単一データセットのすべての `Timeslot`、 `Room`、および `Lesson` インスタンスをラップします。さらに、これにはすべてのレッスンが含まれており、各レッスンには特定のプランニング変数があるため、これは _plannning solution_ であり、スコアがあります。

source: A `Uni` emits a single event (an item or a failure). Unis are convenient to represent asynchronous actions that return 0 or 1 result. A good example is the result of sending a message to a message broker queue.
ja_jp: `Uni` は、単一のイベント（アイテムまたは失敗）を発します。Unisは、0または1の結果を返す非同期アクションを表現するのに便利です。例えば、メッセージ・ブローカーのキューにメッセージを送信した結果などがその例です。

source: A `Uni` of any `@Dao`-annotated interface, e.g. `Uni<FruitDao>`.
ja_jp: `@Dao` アノテーションの付与されたインタフェースの `Uni` 。例： `Uni<FruitDao>` 。

source: A `ValueResolver` is also generated for all beans annotated with `@Named` so that it's possible to access its properties without reflection.
ja_jp: `@Named` でアノテーションされたすべてのBeanに対して `ValueResolver` も生成され、そのプロパティーにリフレクションなしでアクセスできるようになります。

source: A `codestart.yml` file
ja_jp: `codestart.yml` ファイル

source: A `config:property(name)` expression can be used to output the config value for the given property name. The property name can be either a string literal or obtained dynamically by another expression. For example `{config:property('quarkus.lambda.handler')}` and `{config:property(foo.propertyName)}`.
ja_jp: `config:property(name)` 式を使用して、指定されたプロパティー名の設定値を出力することができます。プロパティー名は、文字列リテラルか、別の式で動的に取得することができます。例えば `{config:property('quarkus.lambda.handler')}` や `{config:property(foo.propertyName)}` が可能です。

source: A `db/migration/V1.0.0__\{appname\}.sql` file will be created, containing the SQL Hibernate is running to generate the schema
ja_jp: Hibernate がスキーマを生成するために実行している SQL を含む `db/migration/V1.0.0__\{appname\}.sql` ファイルが作成されます。

source: A `fileUpload` is created from the request's `FileUpload`
ja_jp: リクエストの `FileUpload` から `fileUpload` が作成されます。

source: A `io.vertx.core.buffer.Buffer` - written into the HTTP response directly.
ja_jp: `io.vertx.core.buffer.Buffer` - HTTP レスポンスに直接書き込まれます

source: A `jsonPayload` attribute is added directly to `ClientMultipartForm`
ja_jp: `jsonPayload` 属性が `ClientMultipartForm` に直接追加されます。

source: A `lessonList` field for which each `Lesson` instance has non-null `timeslot` and `room` fields after solving
ja_jp: 解決した後、各 `Lesson` インスタンスに null 以外の `timeslot` フィールドと `room` フィールドがある `lessonList` フィールド

source: A `lessonList` field with all lessons
ja_jp: すべてのレッスンを含む `lessonList` フィールド

source: A `main` method is currently needed for the JBang integration to work - we might remove this requirement in the future.
ja_jp: 現時点で `jbang` の統合が動作するためには `main` メソッドが必要です。

source: A `persistOrUpdate()` method exist that persist or update an entity in the database, it uses the __upsert__ capability of MongoDB to do it in a single query.
ja_jp: `persistOrUpdate()` メソッドは、データベース内のエンティティを永続化または更新するために存在し、MongoDB の _upsert_機能を使用して単一のクエリでそれを行います。

source: A `persistOrUpdate()` method persists or updates an entity in the database, it uses the __upsert__ capability of MongoDB to do it in a single query.
ja_jp: `persistOrUpdate()` メソッドは、データベース内のエンティティーを保持または更新します。これは、MongoDB の __upsert__ 機能を使用して、単一のクエリーで実行されます。

source: A `previous` link header (and hal link) would not be included, because the previous page does not exist.
ja_jp: 前のページが存在しないため、 `previous` リンクヘッダ(および HAL リンク)が含まれません。

source: A `quarkus update` command based on our OpenRewrite upgrade recipes
ja_jp: OpenRewriteのアップグレードレシピに基づいた `quarkus update` コマンド

source: A `roomList` field with all rooms
ja_jp: すべての教室を含む `roomList` フィールド

source: A `score` field that represents the quality of the output solution, for example, `0hard/-5soft`
ja_jp: 出力ソリューションの品質を表す `score` フィールド (例: `0hard/-5soft`)

source: A `timeslotList` field with all time slots
ja_jp: すべてのタイムスロットを含む `timeslotList` フィールド

source: A additional string method parameter is used to pass the actual property name.
ja_jp: 追加の文字列メソッドパラメータは、実際のプロパティ名を渡すために使用されます。

source: A bean class may declare lifecycle `@PostConstruct` and `@PreDestroy` callbacks:
ja_jp: Beanクラスは、ライフサイクル `@PostConstruct` と `@PreDestroy` コールバックを宣言することができます。

source: A bean instance of `MyPredicate.class` is used to evaluate whether an execution should be skipped. There must be exactly one bean that has the specified class in its set of bean types, otherwise the build fails.
ja_jp: `MyPredicate.class` の Bean インスタンスは、実行をスキップすべきかどうかを評価するために使用されます。Beanタイプのセットに指定されたクラスを持つBeanが正確に1つ存在する必要があり、そうでない場合はビルドが失敗します。

source: A bean represented by a class, producer method or field annotated with `@Startup` is initialized at application startup:
ja_jp: `@Startup` でアノテーションされたクラス、プロデューサメソッド、フィールドで表現されたBeanは、アプリケーションの起動時に初期化されます。

source: A bean that might be inactive is typically initialized eagerly, to make sure that an error is thrown at application startup. If the bean is in fact inactive, but is not injected into an always-active bean, eager initialization is skipped and no error is thrown.
ja_jp: 通常、非アクティブである可能性のある Bean は、アプリケーションの起動時に必ずエラーが出力されるように、即時初期化が行われます。 Bean が実際には非アクティブであるが、常にアクティブな Bean に注入されていない場合は、即時初期化がスキップされ、エラーは出力されません。

source: A big thank you to everyone already using RESTEasy Reactive who contributed feedback and fixes!
ja_jp: すでにRESTEasy Reactiveをお使いで、フィードバックや修正を提供していただいた皆様、大変ありがとうございました。

source: A big thank you to everyone involved in the community, contributors, testers... This version is a team effort and wouldn't be as great without all of you.
ja_jp: コミュニティに参加してくださった皆様、コントリビューターの皆様、テスターの皆様、本当にありがとうございました。このバージョンはチームの努力の賜物であり、皆様のおかげで素晴らしいものになりました。

source: A bit more than this
ja_jp: もう少し補足

source: A bit of context
ja_jp: ちょっとした背景説明

source: A bit of fun in some of our examples
ja_jp: いくつかの例の中で、ちょっとした楽しみ

source: A blog post is in the works and should give more details. In the meantime, check out https://github.com/search?q=topic%3Aquarkus-extension+org%3Aquarkiverse&type=Repositories[the extensions that are already there].
ja_jp: ブログ記事を作成中ですので、そちらで詳細をお知らせします。それまでは、 link:https://github.com/search?q=topic%3Aquarkus-extension+org%3Aquarkiverse&type=Repositories[すでにあるエクステンション] をチェックしてみてください。

source: A brief history of HTTP APIs in Quarkus
ja_jp: QuarkusにおけるHTTP APIの簡単な歴史

source: A browser will open to http://localhost:3000. If not navigate to that URL. You should see our table dynamically populated from your Quarkus particle backend. In the developer tools of your browser you will see that the data is actually retrieved from http://localhost:3000/particles
ja_jp: ブラウザで http://localhost:3000 を開きます。開かない場合は、そのURLに移動してください。Quarkusのパーティクルバックエンドからテーブルが動的に入力されているのがわかると思います。ブラウザの開発者ツールでは、データが実際に http://localhost:3000/particles から取得されていることがわかります。

source: A build step can consume build items.
ja_jp: ビルドステップはビルドアイテムを消費することができます。

source: A build step may consume values from previous steps in the following ways:
ja_jp: ビルドステップは、以下の方法で前のステップの値を利用することができます:

source: A build step may produce values for subsequent steps in several possible ways:
ja_jp: ビルドステップは、いくつかの可能な方法で後続のステップのために値を生成することができます。

source: A build step produces build items.
ja_jp: ビルドステップはビルドアイテムを生成します。

source: A build step that consumes the `ContextRegistrationPhaseBuildItem` should always produce a `ContextConfiguratorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
ja_jp: `ContextRegistrationPhaseBuildItem` を消費するビルドステップでは、常に `ContextConfiguratorBuildItem` を生成するか、少なくともこのビルドアイテムに `BuildProducer` を 挿入する必要があります。でなければ、無視されるか、間違ったタイミングで処理される可能性があります (例: 正しい CDI ブートストラップフェーズの後)。

source: A build step that consumes the `ObserverRegistrationPhaseBuildItem` should always produce an `ObserverConfiguratorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
ja_jp: `ObserverRegistrationPhaseBuildItem` を消費するビルドステップでは、常に `ObserverConfiguratorBuildItem` を生成するか、少なくともこのビルドアイテムに `BuildProducer` を 挿入する必要があります。でなければ、無視されるか、間違ったタイミングで処理される可能性があります (例: 正しい CDI ブートストラップフェーズの後)。

source: A build step that consumes the `ValidationPhaseBuildItem` should always produce a `ValidationErrorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
ja_jp: `ValidationPhaseBuildItem` を消費するビルドステップでは、常に `ValidationErrorBuildItem` を生成するか、少なくともこのビルドアイテムに `BuildProducer` を 挿入する必要があります。でなければ、無視されるか、間違ったタイミングで処理される可能性があります (例: 正しい CDI ブートストラップフェーズの後)。

source: A builder-like API is available for more complex formatting requirements.
ja_jp: より複雑なフォーマットを必要とする場合には、ビルダーライクな API が利用可能です。

source: A business rule allows to externalise decision logic into reusable pieces that can be easily used in declarative way. There are multiple ways of writing rules like https://drools.org/learn/dmn.html[DMN models], decision tables, decision trees, rules, etc.
ja_jp: ビジネスルールでは、意思決定ロジックを、簡単に使える再利用可能なものに宣言的な方法で外部化することができます。ルールの書き方には、ディシジョンテーブル、ディシジョンツリー、ルールなど複数の書き方があります。この例では、DRL(Drools Rule Language)に裏打ちされたルール形式に焦点を当てています。

source: A business rule allows to externalise decision logic into reusable pieces that can be easily used in declarative way. There are multiple ways of writing rules like https://drools.org/learn/dmn.html[DMN models], decision tables, decision trees, rules, etc. For this example we focus on the rule format backed by DRL (Drools Rule Language).
ja_jp: ビジネスルールとは、意思決定ロジックを再利用可能なパーツに外部化し、宣言的な方法で簡単に使用できるようにするものです。ルールの書き方には、デシジョンテーブル、デシジョンツリー、ルールなど、さまざまな方法があります。この例では、DRL (Drools Rule Language)によるルール形式に注目します。

source: A call to `Config#getValues("my.collection", String.class)`, will automatically create and convert a `List<String>` that contains the values `dog`, `cat` and `turtle`. A call to `Config#getValues("my.indexed.collection", String.class)` returns the exact same result. If the same property name exists in both forms (regular and indexed), the regular value has priority.
ja_jp: `Config#getValues("my.collection", String.class)` を呼び出すと、値 `dog`、 `cat`、および `turtle` が含まれる `List<String>` が自動的に作成および変換されます。 `Config#getValues("my.indexed.collection", String.class)` を呼び出すと、まったく同じ結果が返されます。同じプロパティー名が両方の形式 (通常およびインデックス付き) に存在する場合、通常の値が優先されます。

source: A call to `Config#getValues("my.collection", String.class)`, will automatically create and convert a `List<String>` that contains the values `dog`, `cat` and `turtle`. A call to `Config#getValues("my.indexed.collection", String.class)` returns the exact same result. If the same property name exists in both froms (regular and indexed), the regular value has priority.
ja_jp: `Config#getValues("my.collection", String.class)` を呼び出すと、値 `dog`、 `cat`、および `turtle` が含まれる `List<String>` が自動的に作成および変換されます。 `Config#getValues("my.indexed.collection", String.class)` を呼び出すと、まったく同じ結果が返されます。同じプロパティー名が両方の形式 (通常およびインデックス付き) に存在する場合、通常の値が優先されます。

source: A call to `Converters.foo()` results in the value `bar`.
ja_jp: `Converters.foo()` を呼び出すと、 `bar` という値が得られます。

source: A capability may be provided only if a certain condition is satisfied, e.g. if a certain configuration option is enabled or based on some other condition. This could be expressed in the following way:
ja_jp: ケイパビリティは、特定の条件が満たされた場合、例えば、特定の構成オプションが有効な場合、または他の条件に基づいてのみ提供される場合があります。これは以下のように表現できます。

source: A capability may be provided or required only if a certain condition is satisfied, for example, if a certain configuration option is enabled or based on some other condition. Here is how a conditional capability promise can be configured:
ja_jp: ケイパビリティは、特定の条件が満たされた場合、例えば、特定の設定オプションが有効な場合、または他の条件に基づいてのみ提供される場合があります。これは以下のように表現できます:

source: A capability represents a technical aspect, for example, it could be an implementation of some functionality, a contract or a specification. Each capability has a name which should follow the Java package naming convention, e.g. `io.quarkus.rest`.
ja_jp: 機能は技術的な側面を表します。たとえば、一部の機能の実装、契約、または仕様である可能性があります。 各機能には、Javaパッケージの命名規則に従う必要のある名前があります。例: `io.quarkus.rest`。

source: A circuit breaker is useful for limiting number of failures happening in the system, when part of the system becomes temporarily unstable. The circuit breaker records successful and failed invocations of a method, and when the ratio of failed invocations reaches the specified threshold, the circuit breaker _opens_ and blocks all further invocations of that method for a given time.
ja_jp: サーキットブレーカーは，システムの一部が一時的に不安定になったときに，システム内で発生する障害の数を制限するのに有効です。サーキットブレーカーは、あるメソッドの成功と失敗を記録し、失敗したメソッドの割合が指定された閾値に達すると、サーキットブレーカーが _開き_、それ以降のメソッドの呼び出しを一定時間ブロックします。

source: A class that mirrors the `MyClass` structure and contains interceptor bindings.
ja_jp: `MyClass` 構造をミラーリングし、インターセプターバインディングを含むクラス。

source: A class that will be initialized at runtime rather than build time. This will cause the build to fail if the class is initialized as part of the native executable build process, so care must be taken.
ja_jp: ビルド時ではなくランタイムで初期化されるクラス。これにより、クラスがネイティブ実行可能ビルドプロセスの一部として初期化されるとビルドに失敗するため、注意が必要です。

source: A class that will be reinitialized at runtime by Substrate. This will result in the static initializer running twice.
ja_jp: Substrate によってランタイムで再初期化されるクラス。これにより、静的イニシャライザーは 2 回実行されます。

source: A client for Apache Kafka
ja_jp: Apache Kafka 用クライアント

source: A client for the Amazon DynamoDB datastore
ja_jp: Amazon DynamoDB データストア用のクライアント

source: A client for the Amazon S3 cloud storage
ja_jp: Amazon S3 クラウドストレージ用のクライアント

source: A client for the Neo4j graph datastore
ja_jp: Neo4j グラフデータストア用のクライアント

source: A client service using a REST client to call the blue or the red service. Service discovery and selection are delegated to Stork.
ja_jp: REST クライアントを使用して、Blue または Red サービスを呼び出すクライアントサービス。サービスの検出と選択は Stork に委譲されます。

source: A codestart unique name, ie `my-codestart`
ja_jp: Codestartのユニークな名前、つまり `my-codestart`

source: A cohesive platform for optimized developer joy with unified configuration and no hassle native executable generation. Zero config, live reload in the blink of an eye and streamlined code for the 80% common usages, flexible for the remainder 20%.
ja_jp: 統一された設定と手間のかからないネイティブ実行可能ファイル生成により、開発者満足を最適化するための一貫したプラットフォームです。ゼロコンフィグ、瞬く間のライブリロード、80%の一般的な用途には合理的なコード、20%の用途には柔軟なコード。

source: A cohesive platform for optimized developer joy:
ja_jp: 開発者満足のために最適化され、一貫したプラットフォーム:

source: A comma-separated list of `-XX:` Java command line options that should not be overridden by values that are pre-configured by the Quarkus Maven and Gradle plugins by default
ja_jp: Quarkus Maven および Gradle プラグインによってデフォルトで事前設定された値によって上書きされるべきではない `-XX:` Java コマンドラインオプションのコンマ区切りリスト

source: A comma-separated list of capabilities proposed by the sender or receiver client. Type: _string_
ja_jp: 送信側または受信側のクライアントが提案する能力のカンマ区切りのリスト。 Type: _string_

source: A comma-separated list of headers that should be recorded as span attributes. Relevant only if tracing.enabled=true Type: _string_
ja_jp: スパン属性として記録する必要があるヘッダーのコンマ区切りリスト。trace.enabled=true の場合にのみ関連します。 Type: _string_

source: A comma-separated list of host:port to use for establishing the initial connection to the Kafka cluster. Type: _string_
ja_jp: Kafka クラスターへの初期接続を確立するために使用する host:port のコンマ区切りリスト Type: _string_

source: A comma-separated list of incoming record headers to be propagated to the outgoing record Type: _string_
ja_jp: 送信レコードに伝搬される、受信レコードヘッダーのカンマ区切りのリスト。 Type: _string_

source: A comma-separated list of routing keys to bind the queue to the exchange Type: _string_
ja_jp: キューをエクスチェンジにバインドするためのルーティングキーのコンマ区切りリスト Type: _string_

source: A comma-separated list of standard Java command line options that should not be overridden by values that are pre-configured by the Quarkus Maven and Gradle plugins by default
ja_jp: Quarkus Maven および Gradle プラグインによってデフォルトで事前設定された値によって上書きされるべきではない、標準の Java コマンドラインオプションのコンマ区切りリスト。

source: A comma-separated list of topics to be consumed. Cannot be used with the `topic` or `pattern` properties Type: _string_
ja_jp: 消費するトピックのコンマ区切りのリスト。`topic` または `pattern` プロパティーとは併用できません。 Type: _string_

source: A comma-separating list of incoming record headers to be propagated to the outgoing record Type: _string_
ja_jp: 送信レコードに伝搬される、受信レコードヘッダーのカンマ区切りのリスト Type: _string_

source: A comma-separating list of topics to be consumed. Cannot be used with the `topic` or `pattern` properties Type: _string_
ja_jp: 消費されるトピックのコンマ区切りのリスト。 `topic` または `pattern` のプロパティとは併用できません。 Type: _string_

source: A command mode application (like a CLI) is a bit different from say a HTTP service, there is a single call from the command line. So the notion of _request_ let alone multiple requests does not exist per se. Therefore request scope is not the default.
ja_jp: コマンドモードのアプリケーション（CLIなど）は、例えばHTTPサービスとは少し異なり、コマンドラインからの呼び出しは1回だけです。そのため、複数のリクエストはおろか、 _リクエスト_という概念自体が存在しません。したがって、リクエストスコープはデフォルトではありません。

source: A command mode application (like a CLI) is a bit different from say an HTTP service, there is a single call from the command line. So the notion of _request_ let alone multiple requests does not exist per se. Therefore, request scope is not the default.
ja_jp: コマンドモードのアプリケーション（CLIなど）は、例えばHTTPサービスとは少し異なり、コマンドラインからの呼び出しは1回だけです。そのため、複数のリクエストはおろか、 _request_ という概念も存在しません。したがって、リクエストスコープはデフォルトではありません。

source: A comment starts with the sequence `{!` and ends with the sequence `!}`, e.g. `{! This is a comment !}`. Can be multiline and may contain expressions and sections: `{! {#if true} !}`. The content of a comment is completely ignored when rendering the output.
ja_jp: コメントは `{!` and ends with the sequence `!}` というシーケンスで終わり、例えば `{! This is a comment !}` のようになります。 複数行にすることができ、`{! {#if true} !}` のように式やセクションを含むことができます。コメントの内容は、出力をレンダリングする際に完全に無視されます。

source: A common business requirement is to consume and process Kafka records in order. The Kafka broker preserves order of records inside a partition and not inside a topic. Therefore, it is important to think about how records are partitioned inside a topic. The default partitioner uses record key hash to compute the partition for a record, or when the key is not defined, chooses a partition randomly per batch or records.
ja_jp: 一般的なビジネス要件は、Kafka レコードを順番に消費して処理することです。Kafka ブローカーは、トピック内ではなく、パーティション内のレコードの順序を保持します。したがって、レコードがトピック内でどのようにパーティショニングされるかを考えることが重要となります。デフォルトのパーティショナーは、レコードキーハッシュを使用してレコードのパーティションを計算するか、キーが定義されていない場合は、バッチまたはレコードごとにランダムにパーティションを選択します。

source: A common environment where both of these cases are pretty common is Kubernetes. To address these challenges, Quarkus allows externalization of such tasks as Kubernetes https://kubernetes.io/docs/concepts/workloads/controllers/job/[Jobs] and uses https://kubernetes.io/docs/concepts/workloads/pods/init-containers/[init containers] to ensure that an application instance only starts once the initialization jobs have finished. With this approach even if an application has multiple replicas, the initialization logic will only run once.
ja_jp: この両方のケースがよくある環境は、Kubernetesです。 このような課題に対処するため、Quarkusでは、このようなタスクをKubernetes link:https://kubernetes.io/docs/concepts/workloads/controllers/job/[ジョブ] として外部化し、 link:https://kubernetes.io/docs/concepts/workloads/pods/init-containers/[initコンテナー] を使用して、初期化ジョブが終了した後にのみアプリケーションインスタンスが起動するようにします。 このアプローチでは、アプリケーションに複数のレプリカがあっても、初期化ロジックは一度しか実行されません。

source: A common pattern for containerized and distributed Quarkus applications is to serve as an efficient and scalable backend for a separate frontend application. In the Kubernetes world a frontend application could be a pure web layer pod such as React, Angular or Vue.js, delegating all REST calls to these Quarkus service layer pods.
ja_jp: コンテナ化された分散型のQuarkusアプリケーションで一般的なパターンとして、別のフロントエンドアプリケーションのための効率的でスケーラブルなバックエンドとして機能することがあります。Kubernetesの世界では、フロントエンドアプリケーションはReact、Angular、Vue.jsなどの純粋なウェブレイヤーPodであり、すべてのRESTコールをQuarkusのサービスレイヤーPodに委ねることができます。

source: A common purpose for an extension is to integrate a non-CDI aware service into the CDI based Quarkus runtime. Step 1 of this task is to load any configuration needed in a STATIC_INIT build step as we did in <<parsing-config-to-objects>>. Now we need to create an instance of the service using the configuration. Let's return to the `TestProcessor#parseServiceXmlConfig` method to see how this can be done.
ja_jp: エクステンションの一般的な目的は、非 CDI 対応のサービスを CDI ベースの Quarkus ランタイムに統合することです。 このタスクの最初のステップは、<<parsing-config-to-objects>> で実行したように、STATIC_INIT ビルドステップで必要な設定をロードすることです。 次に、この設定を使用してサービスのインスタンスを作成する必要があります。 `TestProcessor#parseServiceXmlConfig` メソッドに戻って、これを行う方法を確認しましょう。
